In [1]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [2]:
df.describe()

       degisken1   degisken2
count   6.000000    6.000000
mean   33.000000  338.000000
std    33.436507  322.291793
min    10.000000  100.000000
25%    13.750000  146.500000
50%    22.500000  257.500000
75%    30.500000  315.250000
max    99.000000  969.000000

In [10]:
square = lambda x : x*x if (x<9) else x*x*x
print(square(6), square(10))

36 1000

In [11]:
square_cube = lambda x : x*x if (x<9) else x*x*x
print(square_cube (6), square_cube (10))
#OutPut : 36 1000

36 1000